Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་སྟོང་པ་ཉིད་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་མ་མཆིས་སོ། །
en: Blessed One, emptiness is the root of all phenomena; no view concerning them can be adopted.

source: མཚན་མ་མ་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་མ་མཆིས་སོ། །
en: Signlessness is the root of all phenomena; no concepts can be formed about them.

source: སྨོན་པ་མ་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་ཁམས་གསུམ་པ་རྣམས་ཀྱི་ཉོན་མོངས་པ་རྣམས་མ་མཆིས་སོ། །
en: Wishlessness is the root of all phenomena; it involves none of the afflictive emotions of those in the three realms.

source: མངོན་པར་འདུ་མི་བགྱིད་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་བྱེད་པ་པོ་མ་མཆིས་སོ། །
en: Being unfabricated is the root of all phenomena; there is no creator.

source: བདག་མ་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་བདག་ཏུ་ལྟ་བ་མི་འབྱུང་ངོ་། །
en: The absence of self is the root of all phenomena; views related to the self do not develop.

source: སེམས་ཅན་མ་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་སེམས་ཅན་དུ་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: The absence of beings is the root of all phenomena; views related to beings never develop.

source: སྲོག་མ་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་རྩ་བ་སྟེ། དེ་ལ་སྲོག་ཏུ་ལྟ་བ་ཀུན་དུ་མི་འབྱུང་ངོ་། །
en: The absence of a lifeforce is the root of all phenomena; views related to a lifeforce never develop.

source: ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་པ་སྟེ། དེ་ལ་ཐེར་ཟུག་ཏུ་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: “No phenomena arise; eternalist views never develop.

source: ཆོས་ཐམས་ཅད་ནི་མ་འགགས་པ་སྟེ། དེ་ལ་ཆད་པར་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: No phenomena cease; views of interruption never develop.

source: ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མ་མཆིས་པ་སྟེ། དེ་ལ་འབྱུང་བར་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: All phenomena are insubstantial; views about origination never develop.

source: ཆོས་ཐམས་ཅད་ནི་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་པ་སྟེ། དེ་ལ་འཇིག་པར་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: All phenomena are equal to nirvāṇa; views about destruction never develop.

source: ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་པ་སྟེ། དེ་ལ་སངས་རྒྱས་སུ་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: All phenomena are awakened; views about the Buddha never develop.

source: ཆོས་ཐམས་ཅད་ནི་མ་བགྱིས་པ་སྟེ། དེ་ལ་ཆོས་སུ་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: All phenomena are uncreated; views about the Dharma never develop.

source: ཆོས་ཐམས་ཅད་ནི་འདུས་པ་མ་མཆིས་པ་སྟེ། དེ་ལ་དགེ་འདུན་དུ་ལྟ་བ་ཀུན་ཏུ་མི་འབྱུང་ངོ་། །
en: No phenomena are gathered; views about the Saṅgha never develop.

source: བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐོག་མ་ཁོ་ནར་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་པར་འཚལ་གྱི་བདག་ཉིད་ནི་མ་ལགས་སོ། །
en: The bodhisattva Sārthavāha said, “Blessed One, from the very outset bodhisattvas seek the awakening of all beings, not their own.

source: གང་སེམས་ཅན་གྱི་སླད་དུ་ཐམས་ཅད་རྩོམ་ཡང་སེམས་ཅན་ཡང་མི་དམིགས་ལ། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡང་མི་འདོར་རོ། །
en: In all that they do for beings they hold no concept of ‘effort’ or ‘beings,’ but they also do not give up their great love and compassion.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱམས་པ་ཆེན་པོ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ great love?

source: གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཡང་མི་དམིགས་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བའི་གོ་ཆ་ཡང་མི་འདོར་ཞིང་།
en: Even as they do not hold the concept of ‘being,’ bodhisattvas do not give up the armor fashioned out of every root of virtue and dedicate those roots of virtue to awakening.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་འདི་ནི་བྱམས་པ་ཆེན་པོ་ཞེས་བགྱིའོ། །
en: This is known as great love.

source: གང་སེམས་ཅན་གྱི་བགྱི་བ་རྒྱུན་མི་གཅོད་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great compassion is their continuous activity on behalf of beings.

source: གང་འཁོར་བ་ཉིད་མྱ་ངན་འདས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ལ་ཡང་དག་པར་སྒྲིབ་པའི་བརྩོན་འགྲུས་ཀྱང་མི་འདོར་བ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་སེམས་ཅན་མི་གཏོང་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to recognize saṃsāra itself to be nirvāṇa while not giving up the diligence that has perfected the path; their great compassion is to never forsake beings.

source: གང་བདག་བྱང་ཆུབ་ཏུ་གོ་བགོས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་སེམས་ཅན་གཞན་ཡང་གོ་ཆ་འཚལ་བར་བགྱིད་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to don the armor of awakening themselves; their great compassion is to help other beings seek out the armor.

source: གང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བར་བགྱིད་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བ་ལ་དགེ་བའི་རྩ་བ་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཉིད་ཐོབ་པར་བགྱི་བའི་སླད་དུ་ཡོངས་སུ་སྔོ་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to give up all possessions; their great compassion is to give up all possessions and dedicate the roots of virtue so that all beings attain buddhahood.

source: གང་ཚུལ་ཁྲིམས་དང་བསླབ་པ་དང་། དམ་བཅས་པ་ཐམས་ཅད་མི་ཉམས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་བདག་གི་ཚུལ་ཁྲིམས་ཀྱིས་སེམས་ཅན་གཞན་གྱི་ཚུལ་ཁྲིམས་སྲུང་བར་བགྱིད་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is not allowing their discipline, training, and commitments to deteriorate; their great compassion is to use their own discipline to guard the discipline of other beings.

source: གང་བདག་ཉིད་བཟོད་པ་དང་དེས་པ་ཕུན་སུམ་ཚོགས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་བཟོད་པ་དང་དེས་པས་སེམས་ཅན་འདུལ་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to be rich in patience and gentleness themselves; their great compassion is to tame beings with patience and gentleness.

source: གང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཐོབ་པར་བགྱི་བའི་སླད་དུ་བདག་ཉིད་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྩམས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་བརྩོན་འགྲུས་དེས་སེམས་ཅན་གཞན་དག་ཀྱང་བརྩོན་འགྲུས་ལ་རབ་ཏུ་དགོད་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to be diligent themselves in pursuit of awakening to buddhahood; their great compassion is to use that diligence to instill diligence in other beings.

source: གང་བདག་ཉིད་སེམས་ངེས་པར་རྟོག་པ་ལ་གནས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་ངེས་པར་རྟོག་པ་དེས་གཞན་ཡང་ངེས་པར་རྟོག་ཏུ་འཇུག་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to continuously examine their own mind; their great compassion is to use that self-examination to facilitate others in their examination.

source: གང་བདག་ཤེས་རབ་ཡོངས་སུ་རྟོག་པར་བགྱི་བའི་སླད་དུ་རྩོལ་བ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་རང་གི་ཤེས་རབ་ཀྱིས་སེམས་ཅན་གཞན་རྣམས་ཀྱི་ཤེས་རབ་འཕེལ་བར་བགྱིད་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to pursue the development of their own insight; their great compassion is to use their insight to increase the insight of other beings.

source: གང་བརྩོན་པ་ཡང་མ་ལགས། མི་བརྩོན་པ་ཡང་མ་ལགས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་བགྱིད་པ་ཡང་མ་ལགས། མི་བགྱིད་པ་ཡང་མ་ལགས་པ་དེ་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: “The bodhisattvas’ great love is not to strive and not to avoid striving; their great compassion is not to act and not to avoid acting.

source: གང་སྐྱེ་ཡང་མི་འཕོ་བ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་འཕོ་བ་ཡང་མི་གཡོ་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to be born and not pass away; their great compassion is to pass away but not leave.

source: གང་སྨྲ་ཡང་བརྗོད་པ་མ་མཆིས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་གྲོལ་ཡང་འཆིང་བ་ཡང་མི་འདོར་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to speak while not saying anything; their great compassion is to be liberated without rejecting bondage.

source: གང་འཚང་རྒྱ་ཡང་ཁོང་དུ་ཆུད་པ་ཡང་མ་མཆིས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་ཡོངས་སུ་མྱ་ངན་ལས་ཀྱང་འདའ་ལ་ནུབ་པར་ཡང་མི་འགྱུར་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to be awakened, not understand it; their great compassion is to pass into final nirvāṇa without fading away.

source: གང་ལུས་ཀྱི་རིང་བསྲེལ་ཕྱེ་མར་འགྱུར་ལ། རུས་པ་དང་། རྒྱུས་པ་དང་། ཁྲག་དང་། ལུས་ཀྱང་མ་མཆིས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is let the constituents of the body become dust, not bone, tendons, blood, and marrow; their great compassion is to neither exhaust nor increase those relics.

source: གང་རིང་བསྲེལ་དེ་དག་བས་པར་ཡང་མི་འགྱུར། འཕེལ་བར་ཡང་མི་འགྱུར་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །གང་སྦྱིན་པ་ཡང་སྦྱིན་ལ་གཏོང་བ་ཡང་མཆིས་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་སྨོན་ལམ་ཡང་འདེབས་ལ་འཇོག་པ་ཡང་མ་མཆིས་པ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་སོ། །
en: Their great love is to give gifts while not giving; their great compassion is to make aspirations while not actually making them.

source: གང་སྲུང་ཡང་སྒྲུབ་པར་ཡང་མི་བགྱིད་པ་འདི་ནི་དེའི་བྱམས་པ་ཆེན་པོ་ལགས་སོ། །གང་འཕེལ་བ་ཡང་འཕེལ་ལ་ལྷག་པར་ཡང་མི་འགྱུར་བ་འདི་ནི་དེའི་སྙིང་རྗེ་ཆེན་པོ་ལགས་ཏེ།
en: Their great love is to protect without accomplishing; their great compassion is to increase what is to be increased, but not to excess.

source: བྱང་ཆུབ་སེམས་དཔའ་འོད་རྟོག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ངེས་པར་རྟོག་པར་བགྱིའོ། །
en: The bodhisattva Prabhāketu said, “Blessed One, bodhisattvas investigate.

source: བཅོམ་ལྡན་འདས་ངེས་པར་རྟོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སངས་རྒྱས་ཀྱི་ཆོས་གཞན་རྣམས་བདག་ཉིད་ཀྱིས་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: All the other qualities of a buddha will manifest naturally for bodhisattvas who investigate.

source: ངེས་པར་རྟོག་པ་གཙོ་བོར་བགྱིད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདེ་བར་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འཐོབ་སྟེ།
en: Bodhisattvas who prioritize investigation will easily attain perfect awakening.

source: དེ་ནི་གཟུངས་ལགས་སོ། །
en: They also have the power of dhāraṇī.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་གང་ཞེ་ན།
en: What is a bodhisattva’s power of dhāraṇī?

source: གང་གིས་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཆུད་མི་གཟོན་པ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་འཛིན་པ་དང་། ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ཁོང་དུ་ཆུད་པ་དང་། གཞན་དག་ཀྱང་ཁོང་དུ་ཆུད་པར་བགྱིད་པ་འདི་ནི་གཟུངས་ཞེས་བགྱིའོ། །
en: It is the means by which bodhisattvas do not forget the Dharma teachings they have heard, remember them as they heard them, understands them as they heard them, and otherwise cultivate understanding.

source: གང་གིས་མི་གཡོ་བ་དང་།
en: It is the means by which they are undistracted and nonconceptual.

source: མི་རྟོག་པ་དང་། གང་གིས་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་འཛིན་པ་དང་། དྲན་པར་ཡང་མི་བགྱིད།
en: It is the means by which they remember the collection of eighty-four thousand Dharma teachings without needing to recall them and without allowing them to slip from their memory.

source: བསྐྱུད་པར་ཡང་མི་བགྱིད་པ་དང་། གང་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་འཚལ་ཏེ། འཚལ་ནས་ཀྱང་སེམས་ཅན་དེ་དག་ལ་དེ་བཞིན་དུ་འཇུག་པ་དང་།
en: It is the means by which they examine the conduct of all beings and, upon examination, engage with them appropriately.

source: གང་གིས་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྨྲས་པ་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་འཕགས་པ་མ་ལགས་པའི་སྒྲ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་རྙེད་པ་དང་། འཕགས་པས་སྨྲས་པ་རྣམས་ལ་བྱམས་པ་ཆེན་པོ་རྙེད་པ་དང་།
en: It is the means by which they listen to what beings say, and upon hearing it, feel great compassion for the words of the ignoble and great love for the statements of the noble ones.

source: གང་གིས་ཆོས་ཀྱི་ཚིག་གཅིག་བཟུང་ནས་བསྐལ་པར་བསྟན་ཀྱང་དེའི་སྤོབས་པ་མཐར་མི་ཕྱིན་ཅིང་བས་པར་མི་འགྱུར་བ་དང་།
en: It is the means by which they can learn a single word of the Dharma and teach on it for an eon without reaching the limit of or exhausting their confident eloquence.

source: གང་གིས་བརྗོད་པ་དང་མི་བརྗོད་པ་ཐམས་ཅད་འཚལ་བ་དང་། གང་གིས་སྨྲས་པ་ཐམས་ཅད་སངས་རྒྱས་ཀྱིས་གསུངས་པར་འཚལ་བ་དང་།
en: It is the means by which they understand what is said and not said and understand the Buddha’s teaching in every statement.

source: གང་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་གསུངས་པ་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་དང་།
en: It is the means by which they hear the teachings of the thus-gone, blessed, completely perfect buddhas in every worldly realm throughout the ten directions, and upon hearing them, comprehend it all.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་གི་ཐད་ན་ཆོས་ཉན་ཀྱང་དེ་བཞིན་གཤེགས་པ་གཉིས་ཀྱིས་ཆོས་བསྟན་པ་ལ་སྒྲིབ་པར་ཡང་མི་འགྱུར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཟུངས་ཞེས་བགྱིའོ། །
en: The bodhisattvas’ power of dhāraṇī is that which allows them to hear the Dharma directly from one thus-gone one without obscuring the Dharma teachings given by a second thus-gone one.

source: མངོན་པར་བསྒྲུབ་པའི་གཟུངས་ཀྱང་འཐོབ་སྟེ། དེས་ཆོས་ཐམས་ཅད་མངོན་དུ་སྟོན་པ་དང་། ཆོས་ཀྱི་ཚིག་གཅིག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་དབྱིངས་མ་ལུས་པར་སྟོན་ཀྱང་དེས་དེ་རྒྱགས་པར་མི་འགྱུར།
en: “Bodhisattvas also attain the accomplished power of dhāraṇī, through which they directly reveal all phenomena, revealing the entire expanse of phenomena just as they would a single word of the Dharma.

source: བག་མ་མཆིས་པར་མི་འགྱུར་རོ། །ལྷག་པར་བསྡུ་བའི་གཟུངས་ཀྱང་འཐོབ་སྟེ།
en: It also keeps them from becoming arrogant about this, and keeps them from being careless.

source: དེས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་གྱུར་པའི་གཏམ་བརྗོད་ཅིང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མར་གྱུར་པ་ཡང་ལགས་སོ། །སེལ་བའི་གཟུངས་ཀྱང་འཐོབ་སྟེ།
en: “Bodhisattvas also attain the all-encompassing power of dhāraṇī; through that they give instructions that are revered by the entire world and become themselves revered by the entire world.

source: དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་ཐམས་ཅད་དང་། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་ཏོ། །ལྷག་པར་བསྡུ་བ་དང་། སེལ་བའི་གཟུངས་ཀྱང་འཐོབ་སྟེ།
en: They attain the power of dhāraṇī that dispels; through that they dispel all the doubts and all the afflictive emotions of every being.

source: དེས་དཀར་པོའི་ཆོས་རྣམས་འཕེལ་བར་བགྱིད་ཅིང་ནག་པོ་རྣམས་ཟད་པར་བགྱིད་དོ། །
en: They attain the power of dhāraṇī that is all-encompassing and dispels; through that they increase virtuous factors and lessen nonvirtuous factors.

source: སྒྲུབ་པའི་གཟུངས་ཀྱང་འཐོབ་སྟེ། དེས་ཆོས་ཐམས་ཅད་ཀྱི་སྒྲུབ་པ་ཡང་འཚལ་ཅིང་དེ་སྒྲུབ་ཀྱང་། རྣམ་པར་རྟོག་པར་ཡང་མི་བགྱིད། སྤྱོད་ཀྱང་ལུས་དང་སེམས་ཀྱིས་བརྩོན་པར་ཡང་མི་བགྱིད།
en: “They attain the power of perfected dhāraṇī; through that they seek the perfection of all phenomena, avoid concepts, and maintain their conduct with no effort of body or mind.

source: འཆད་ཀྱང་ཡི་གེ་རྣམས་སྒྲོ་འདོགས་པར་ཡང་མི་བགྱིད།
en: They give explanations without the conceptual imputations of language.

source: སྤོང་བར་ཡང་སེལ་བར་ཡང་མི་བགྱིད། ཡོངས་སུ་རྫོགས་པར་བགྱིད་ཀྱང་གང་དུ་ཆོས་གང་ཡང་སྡུད་པར་ཡང་མི་བགྱིད།
en: They abandon without dispelling anything, and they bring about perfection without gathering any qualities in any way.

source: ཉུང་ངུར་ཡང་བགྱིད་ལ་འགྲིབ་པར་ཡང་མི་བགྱིད། རྗོད་པར་ཡང་བགྱིད་ལ་མངོན་པར་བརྗོད་པ་ཡང་མ་མཆིས།
en: They reduce without diminishing and speak without actually saying anything.

source: མྱ་ངན་ལས་ཀྱང་འདའ་ལ་འཁོར་བ་ལས་ཀྱང་མི་གཡོ། འཕགས་པ་ཉིད་ཀྱང་འཐོབ་ལ་སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཀྱང་མི་གཡོ།
en: They pass into nirvāṇa without leaving saṃsāra, attain the status of a noble one without deviating from the state of an ordinary person, and are victorious over Māra without suppressing others with their body, speech, or mind.

source: བདུད་ལས་རྣམ་པར་རྒྱལ་བར་ཡང་བགྱིད་ལ་ལུས་དང་སེམས་དང་ངག་གིས་ཕ་རོལ་ཀྱང་མི་གནོན་པ་འདི་ནི་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: Blessed One, this is a discourse on the Dharma of bodhisattvas.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་དེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་བཅིངས་པའམ་གྲོལ་བར་ཡོངས་སུ་བརྟག་པར་མི་བགྱིའོ། །
en: The bodhisattva Vimukticandra said, “Blessed One, all phenomena have the quality of liberation, but a bodhisattva does not make a distinction between bondage and liberation.

source: བཅོམ་ལྡན་འདས་རྣམ་པར་གྲོལ་བ་ནི་གང་གི་ཡང་མ་ལགས་སོ། །རྣམ་པར་གྲོལ་བ་ཡང་གང་ཡང་མ་ལགས་སོ། །
en: Blessed One, nothing possesses liberation, nor is there any liberation.

source: བཅོམ་ལྡན་འདས་རྣམ་པར་གྲོལ་བ་ནི་ཆོས་གང་ཡང་འཕེལ་བར་ཡང་མི་བགྱིད་འབྲི་བར་ཡང་མི་བགྱིད་དོ། །
en: Blessed One, liberation neither enhances nor diminishes any phenomena.

source: བཅོམ་ལྡན་འདས་རྣམ་པར་གྲོལ་བ་ནི་གང་ནས་ཀྱང་མི་མཆི། བཅིངས་པ་ནི་གང་དུ་ཡང་མི་མཆིའོ། །
en: Blessed One, liberation does not come from somewhere, nor does bondage go anywhere.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་སེམས་རྣམ་པར་གྲོལ་བ་འདི་ལྟར་བདག་ནི་སེམས་རྣམ་པར་གྲོལ་བའོ་སྙམ་དུ་མི་སེམས་ཏེ།
en: Blessed One, monks whose minds are liberated in this way do not think, ‘I have a liberated mind.’

source: གཞན་དུ་ན་ཇི་ལྟར་རྣམ་པར་གྲོལ་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་འཚལ་ཏོ། །
en: Rather, they have determined that liberation applies to all phenomena.

source: བཅོམ་ལྡན་འདས་གང་འདི་ལྟར་འཁོར་བ་ནི་སྐྱོན་ཆགས་པ་མྱ་ངན་ལས་འདས་པ་ནི་རྣམ་པར་གྲོལ་བའོ་སྙམ་དུ་སེམས་པ་འདི་ནི་སེམས་རྣམ་པར་གྲོལ་བ་མ་ལགས་སོ། །
en: “Blessed One, someone who thus thinks that saṃsāra is full of faults and nirvāṇa is liberation does not have a liberated mind.

source: བདག་ཏུ་འཛིན་པ་ནི་དེ་ལྟར་སེམས་པའི་སླད་དུའོ། །
en: This indicates that they mentally cling to the self.

source: བཅོམ་ལྡན་འདས་གང་འདི་ལྟར་བདག་གི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱིས་ཆོག་གིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་སྙམ་པ་དེ་ནི་སེམས་རྣམ་པར་གྲོལ་བ་མ་ལགས་སོ། །
en: Blessed One, someone who thinks, ‘My aggregates, elements, and sense bases have sufficiently passed into final nirvāṇa’ does not have a liberated mind.

source: བཅོམ་ལྡན་འདས་སེམས་རྣམ་པར་གྲོལ་བའི་དགེ་སློང་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱིས་མི་ཤེས་ཏེ།
en: Blessed One, a monk whose mind is liberated thinks, ‘All phenomena have this quality of liberation, which is something that ordinary foolish beings do not know.

source: བདག་གིས་དེ་ལྟར་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ་སྙམ་དུ་སེམས་ལགས་སོ། །
en: I should come to understand the true state of things in this way.’

source: བཅོམ་ལྡན་འདས་སེམས་རྣམ་པར་གྲོལ་བའི་དགེ་སློང་ནི་བདག་གིས་སེམས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི། དེ་ཡང་འདི་ལྟར་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བའི་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་གྲོལ་བ་ཀུན་དུ་ཚོལ་བ་དེ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་བྱའོ་སྙམ་དུ་སེམས་ལགས་སོ། །
en: “Blessed One, monks whose minds are liberated do not think, ‘I will attain a liberated mind,’ but they do think, ‘I should have great compassion for those who seek liberation in relation to phenomena that are completely liberated.

source: གང་རྣམ་པར་གྲོལ་བ་ཀུན་དུ་ཚོལ་བ་དེ་དག་ནི་རྣམ་པར་གྲོལ་བ་མི་འཐོབ་པའི་སླད་དུའོ། །
en: Because those who seek liberation do not attain liberation.’

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་རྣམ་པར་གྲོལ་བ་ཚོལ་བའི་དགེ་སློང་གིས་བཅིངས་པ་བཙལ་བར་བགྱིའོ། །
en: Thus, Blessed One, a monk who seeks liberation actively seeks bondage.

source: གང་གིས་བཅིངས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་དེ་རྣམ་པར་གྲོལ་བ་ལ་མི་རྟོག་སྟེ།
en: One who accurately sees bondage does not conceptualize liberation.

source: དེ་སེམས་རྣམ་པར་གྲོལ་བ་ཞེས་བགྱིའོ། །
en: That is known as the liberated mind.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: Blessed One, this is a discourse on the Dharma of a bodhisattva.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་རྒྱ་མཚོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཉོན་མོངས་པ་རྣམས་ལ་འཇིགས་པར་མི་བགྱིའོ། །
en: The bodhisattva Sāgaramati next addressed the Blessed One: “Blessed One, a bodhisattva does not fear the afflictive emotions.

source: གང་ན་ཉོན་མོངས་པ་མཆིས་པ་དེ་ན་བྱང་ཆུབ་མཆིས་ཤིང་ཉོན་མོངས་པ་མ་མཆིས་པ་ལ་བྱང་ཆུབ་ཀྱང་མ་མཆིས་པའི་སླད་དུའོ། །
en: Because where there are afflictive emotions there is awakening, and where there are no afflictive emotions there is no awakening.

source: སྟོང་པ་ཉིད་དང་ཉོན་མོངས་པ་ནི་མི་གཉིས་ཏེ་གཉིས་སུ་དབྱེར་མ་མཆིས་སོ། །
en: Emptiness and the afflictive emotions are not two; they cannot be separated into two.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་དང་ཉོན་མོངས་པ་ནི་མི་གཉིས་ཏེ་གཉིས་སུ་དབྱེར་མ་མཆིས་སོ། །
en: Blessed One, awakening and the afflictive emotions are not two; they cannot be separated into two.

source: གཞན་དུ་ན་ཕྱིན་ཅི་ལོག་ཏུ་ལྷུང་བའི་སེམས་ཀྱི་རྒྱུན་གྱིས་བྱིས་པ་སོ་སོའི་སྐྱ་བོ་རྣམས་བདག་ནི་ཉོན་མོངས་སོ། །
en: This is not something that ordinary foolish beings understand.

source: རྣམ་པར་དག་གོ་སྙམ་དུ་འཚལ་བ་ནི་མ་མཆིས་པ་ལགས་སོ། །
en: Because their minds have sunk into error, they think, ‘I am afflicted’ and ‘I am pure.’

source: བཅོམ་ལྡན་འདས་ཡང་དག་པར་བཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉོན་མོངས་པ་ཡང་མི་སེལ་ཉོན་མོངས་པ་མ་མཆིས་པ་ཡང་མི་སྒྲུབ་བོ། །
en: Blessed One, a bodhisattva who takes the correct approach neither clears away afflictive emotions nor fails to be free of afflictive emotions.

source: བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པའི་སྒོ་ལ་སོ་སོར་རྟོག་པ་ནི་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་འཐོབ་བོ། །
en: A bodhisattva who analyzes the gateway of the afflictive emotions attains the gateway of samādhi and dhāraṇī.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་ཉོན་མོངས་པ་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་དག་གི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་རིགས་ལགས་སོ། །
en: “Therefore, Blessed One, the afflictive emotions themselves are classified among a bodhisattva’s qualities of buddhahood.

source: ཉོན་མོངས་པ་དེ་དག་ལ་གཡེངས་ཤིང་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པའི་བློ་ཅན་བྱིས་པ་དེ་དག་ནི་ངན་སོང་དུ་གཞོལ་བ་སྡུག་བསྔལ་མྱོང་བར་འགྱུར་བའོ། །
en: A foolish being whose mind is distracted by afflictive emotions and falls into error is inclined to the lower realms and experiences suffering.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཡང་དག་པར་སོ་སོར་རྟོག་པས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཁོང་དུ་ཆུད་དོ། །
en: Bodhisattvas correctly analyze them and understand the awakening of buddhahood.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་རྒྱུན་ལས་བཟློག་སྟེ། འཇུག་པར་བགྱི་རྒྱུན་གྱི་རྗེས་སུ་འཇུག་པར་མི་བགྱིའོ། །
en: Blessed One, bodhisattvas thus go against the current; they act while not following the current.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ནི་མྱ་ངན་ལས་འདས་པ་ལས་རྣམ་པར་གྲོལ་གྱི། འཁོར་བ་ལས་ནི་མ་ལགས་སོ། །
en: “Blessed One, bodhisattvas are liberated from nirvāṇa, but not from saṃsāra.

source: བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས་འདས་པ་ལ་འཇིགས་པར་བགྱིའོ། །འཁོར་བ་ལ་ནི་མ་ལགས་སོ། །
en: Bodhisattvas fear nirvāṇa but not saṃsāra.

source: འཁོར་བ་ལ་སོ་སོར་བརྟགས་ན་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་འཐོབ་བོ། །སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་འཐོབ་བོ། །
en: When they analyze saṃsāra they gain compassion for beings and attain the awakening of buddhahood.

source: མྱ་ངན་ལས་འདས་པ་ལ་ཡོངས་སུ་བརྟགས་ན་འཁོར་བ་ལ་ཞེ་འགྲས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བ་ལ་ཞེ་འགྲས་པ་ནི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཡོངས་སུ་ཉམས་སོ། །
en: When they investigate nirvāṇa they grow hostile toward saṃsāra, and a bodhisattva who grows angry with saṃsāra undermines awakening to buddhahood.

source: འཁོར་བ་ན་གནས་པ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའི། མྱ་ངན་ལས་འདས་པ་ལ་གནས་པ་རྣམས་ལ་ནི་མ་ལགས་སོ། །
en: A bodhisattva’s great love and compassion develops by remaining in saṃsāra, but not when remaining in nirvāṇa.

source: བཅོམ་ལྡན་འདས་མྱ་ངན་ལས་འདས་པ་མྱ་ངན་ལས་འདས་པ་ཞེས་བགྱི་བ་ནི་ཡང་དག་པ་མ་ལགས་པ་ཡོངས་སུ་རྟོག་པ་རབ་ཏུ་ཞི་བའི་ཚིག་བླ་དགས་ལགས་སོ། །
en: Blessed One, the term nirvāṇa applied to nirvāṇa is not accurate; it is another way of saying ‘pacified concepts.’

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་མྱ་ངན་ལས་འདས་པ་ཚོལ་བའི་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་རྟོག་པ་ཉེ་བར་ཞི་བ་བཙལ་བར་བགྱི་སྟེ། དེ་ལས་མྱ་ངན་ལས་འདའ་བ་འཐོབ་པར་འགྱུར་རོ། །
en: Therefore, Blessed One, a bodhisattva who pursues nirvāṇa pursues the pacification of concepts, and based on that attains nirvāṇa.

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ།། །།བམ་པོ་བདུན་པ་སྟེ་ཐ་མ།
en: Blessed One, this is a discourse on the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཤིན་ཏུ་མང་པོ་ལ་བསླབ་པར་མི་བྱའོ། །
en: The bodhisattva Avalokiteśvara next addressed the Blessed One: “Blessed One, bodhisattvas should not train in too many qualities.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཆོས་གཅིག་རབ་ཏུ་བཟུང་ཞིང་རབ་ཏུ་རྟོགས་པར་བགྱིས་ན། བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དེའི་ལག་མཐིལ་དུ་མཆིས་པ་ལགས་སོ། །
en: Blessed One, if bodhisattvas fully understand and comprehend a single quality, then, Blessed One, all the qualities of the Buddha will be in the palm of their hand.

source: ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: What is this one Dharma teaching?

source: འདི་ལྟ་སྟེ་སྙིང་རྗེ་ཆེན་པོའོ། །
en: It is great compassion.

source: བཅོམ་ལྡན་འདས་སྙིང་རྗེ་ཆེན་པོས་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལག་མཐིལ་དུ་མཆིས་པ་ལགས་སོ། །
en: Blessed One, through great compassion the entire Dharma of the Buddha is in the bodhisattvas’ hands.
